app/Controllers/AdminController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $data['title']='List User';

        $users = new UserModel();
        $data['users'] = $users->findAll();