app/Controllers/pembayaranController.php

SELECT *
FROM `pembayaran`
---
    public function index()//menampilkan pembayaran
    {
        $data['title']='List Metode Pembayaran';

        $pembayaran = new PembayaranModel();
           ## Fetch all records
         $data['pembayaran'] = $pembayaran->findAll();