app/Models/KamarModel.php

    public function getKamar($id = false)
    {
        if($id === false){
            return $this->findAll();
---
SELECT *
FROM `kamar`