app/Models/TransaksiModel.php

SELECT *
FROM `kamar`
---
public function getKamar()
{
    $builder = $this->db->table('kamar');
    return $builder->get();

SELECT *
FROM `transaksi`
JOIN `users` ON `users`.`userid`=`transaksi`.`userid`
JOIN `kamar` ON `kamar`.`nokamar`=`transaksi`.`nokamar`
---
   public function getTransaksi()
   {
        return $this->db->table('transaksi')
        ->join('users','users.userid=transaksi.userid')
        ->join('kamar','kamar.nokamar=transaksi.nokamar')
        ->get()->getResultArray();